In [1]:
import pandas as pd

In [5]:
df = pd.read_csv("pandaLearn.csv")

In [3]:
pd

In [6]:
df

      Name  age       city
0     Noor   22     Jaipur
1  Tasneem   22      Delhi
2    Anzil   22     Kanpur
3   Muskan   20    Kolkata
4   Anisha   22  Jhunjhunu

In [9]:
#creating data frame using dictionary

weather_data={
    'day':['1/1/2017','1/2/2017','1/3/2017','1/5/2017','3/102017','1/12/2018'],
    "temperature":[32,32,43,45,64,34],
    'windspeed':[2,5,7,4,3,8],
    'event':['sunny','snow','rain','windy','snow','rain']
}
df2 = pd.DataFrame(weather_data)
df2

         day  temperature  windspeed  event
0   1/1/2017           32          2  sunny
1   1/2/2017           32          5   snow
2   1/3/2017           43          7   rain
3   1/5/2017           45          4  windy
4   3/102017           64          3   snow
5  1/12/2018           34          8   rain

In [13]:
#shape of data frame
df2.shape

(6, 4)

In [15]:
row, col = df2.shape
print(row,col)

6 4

In [10]:
#default print last 5
df2.tail()

         day  temperature  windspeed  event
1   1/2/2017           32          5   snow
2   1/3/2017           43          7   rain
3   1/5/2017           45          4  windy
4   3/102017           64          3   snow
5  1/12/2018           34          8   rain

In [18]:
#default print top five
df2.head()

        day  temperature  windspeed  event
0  1/1/2017           32          2  sunny
1  1/2/2017           32          5   snow
2  1/3/2017           43          7   rain
3  1/5/2017           45          4  windy
4  3/102017           64          3   snow

In [23]:
df2.head(2)

        day  temperature  windspeed  event
0  1/1/2017           32          2  sunny
1  1/2/2017           32          5   snow

In [22]:
df2.tail(2)

         day  temperature  windspeed event
4   3/102017           64          3  snow
5  1/12/2018           34          8  rain

In [24]:
df2[:]

         day  temperature  windspeed  event
0   1/1/2017           32          2  sunny
1   1/2/2017           32          5   snow
2   1/3/2017           43          7   rain
3   1/5/2017           45          4  windy
4   3/102017           64          3   snow
5  1/12/2018           34          8   rain

In [25]:
df2[1:3]

        day  temperature  windspeed event
1  1/2/2017           32          5  snow
2  1/3/2017           43          7  rain

In [30]:
df2.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [34]:
df2['day']  #df2.day

0     1/1/2017
1     1/2/2017
2     1/3/2017
3     1/5/2017
4     3/102017
5    1/12/2018
Name: day, dtype: object

In [17]:
type(df2['temperature'])

pandas.core.series.Series

In [18]:
df2['temperature'].max()
#df2['temperature'].min()

64

In [20]:
#standard deviation
df2['temperature'].std()

12.30717947649528

In [21]:
df2.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     41.666667   4.833333
std      12.307179   2.316607
min      32.000000   2.000000
25%      32.500000   3.250000
50%      38.500000   4.500000
75%      44.500000   6.500000
max      64.000000   8.000000

In [23]:
df2[df2.temperature>=32]

         day  temperature  windspeed  event
0   1/1/2017           32          2  sunny
1   1/2/2017           32          5   snow
2   1/3/2017           43          7   rain
3   1/5/2017           45          4  windy
4   3/102017           64          3   snow
5  1/12/2018           34          8   rain

In [24]:
df2[df2.temperature>=df2.temperature.max()]

        day  temperature  windspeed event
4  3/102017           64          3  snow